Documents/Продажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Продажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Продажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	СтрокаСТоваром = Элементы.Товары.ТекущиеДанные;
	СтрокаСТоваром.СуммаНДС = ПолучитьСуммуНДС(СтрокаСТоваром.Цена * СтрокаСТоваром.Количество, ПолучитьСтавкуНДС());
	СтрокаСТоваром.СуммаПродажи = РасчетСуммы(СтрокаСТоваром.Цена, СтрокаСТоваром.Количество);
КонецПроцедуры


Функция РасчетСуммы(Цена, Количество)
	Сумма = Цена * Количество;
	СуммаНДС = ПолучитьСуммуНДС(Сумма, ПолучитьСтавкуНДС());
	Возврат Сумма + СуммаНДС;
КонецФункции

Функция ПолучитьСуммуНДС(Сумма, СтавкаНДС)
	Возврат Сумма / 100 * СтавкаНДС;
КонецФункции

Функция ПолучитьСтавкуНДС()
	Возврат Константы.СтавкаНДС.Получить();
КонецФункции	


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	СтрокаСТоваром = Элементы.Товары.ТекущиеДанные;
	СтрокаСТоваром.СуммаНДС = ПолучитьСуммуНДС(СтрокаСТоваром.Цена * СтрокаСТоваром.Количество, ПолучитьСтавкуНДС());
	СтрокаСТоваром.СуммаПродажи = РасчетСуммы(СтрокаСТоваром.Цена, СтрокаСТоваром.Количество);
КонецПроцедуры
